# Создать список и заполнить его элементами различных типов данных, определить типы
list_a = [1, 'b', 5.5, 'f', 'w', False]
for b in list_a:
    print(type(b))
